app/controllers/api/furnitures_controller.rb

  def index
      @furnitures = Furniture.all
---
SELECT "furnitures".* FROM "furnitures"

  def show
      @furniture = Furniture.find_by(id: params[:id])
---
SELECT  "furnitures".* FROM "furnitures" WHERE "furnitures"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]