app/controllers/api/orders_controller.rb

UPDATE "orders" SET "quantity" = $1, "updated_at" = $2 WHERE "orders"."id" = $3  [["quantity", 2], ["updated_at", "2021-12-03 01:15:47.971196"], ["id", 32]]
---
  def update
    @order= Order.find_by(id: params[:id])
    if @order
      @order.update(order_params)