app/controllers/api/orders_controller.rb

  def index
    @orders = User.find(current_user.id).orders
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "orders".* FROM "orders" WHERE "orders"."user_id" = $1  [["user_id", 1]]

  def create
    @user = User.find(current_user.id)
    orders = @user.orders
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]