app/controllers/api/orders_controller.rb

  def create
    @user = User.find(current_user.id)
    orders = @user.orders
    if !orders.empty?
      furniture_id = order_params[:furniture_id].to_i
      order = orders.select{ |order| order.furniture_id == furniture_id}
      if !order.empty?
        @order = order[0]

        @order.quantity += order_params[:quantity].to_i
      else
        @order = Order.new(order_params)
      end
    else
      @order = Order.new(order_params)
    end

    if @order.save
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT  "orders".* FROM "orders" WHERE "orders"."user_id" = $1 LIMIT $2  [["user_id", 1], ["LIMIT", 1]]
SELECT  1 AS one FROM "orders" WHERE "orders"."user_id" = $1 LIMIT $2  [["user_id", 1], ["LIMIT", 1]]
SELECT "orders".* FROM "orders" WHERE "orders"."user_id" = $1  [["user_id", 1]]
INSERT INTO "orders" ("quantity", "user_id", "furniture_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["quantity", 1], ["user_id", 1], ["furniture_id", 2], ["created_at", "2021-12-03 02:58:46.188823"], ["updated_at", "2021-12-03 02:58:46.188823"]]

  def update
    @order= Order.find_by(id: params[:id])
    if @order
      @order.quantity += params[:quantity]
      @order.save
---
UPDATE "orders" SET "quantity" = $1, "updated_at" = $2 WHERE "orders"."id" = $3  [["quantity", 2], ["updated_at", "2021-12-03 06:53:29.718595"], ["id", 36]]