app/controllers/api/reviews_controller.rb

  def show
    @review = Review.find_by(id: params[:id])
---
SELECT  "reviews".* FROM "reviews" WHERE "reviews"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

  def create
    @review = Review.new(review_params)
    if @review.save
---
INSERT INTO "reviews" ("title", "body", "stars", "reviewer_id", "furniture_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"

  def index
    @reviews = Review.where(furniture_id: params[:furniture_id])
---
SELECT "reviews".* FROM "reviews" WHERE "reviews"."furniture_id" = $1  [["furniture_id", 2]]

  def destroy
    @review = Review.find_by(id: params[:id])
    if @review
      @review.destroy
---
SELECT  "reviews".* FROM "reviews" WHERE "reviews"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
DELETE FROM "reviews" WHERE "reviews"."id" = $1  [["id", 1]]

  def update
    @review = Review.find_by(id: params[:id])
    if @review.nil?
      render json: ["No Review"], status: 400
    elsif  @review.update(review_params)
---
SELECT  "reviews".* FROM "reviews" WHERE "reviews"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
UPDATE "reviews" SET "title" = $1, "body" = $2, "stars" = $3, "updated_at" = $4 WHERE "reviews"."id" = $5  [["title", "this is the new title"], ["body", "this is the new body"], ["stars", 5], ["updated_at", "2022-02-01 01:40:41.797968"], ["id", 13]]