app/controllers/api/users_controller.rb

  def create
    @user = User.new(user_params)
    if @user.save
---
INSERT INTO "users" ("email", "password_digest", "session_token", "created_at", "updated_at", "first_name", "last_name") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"

  def update
    @user = User.find_by(id: params[:id])
    if @user.nil?
      render json: ["No Known User"], status: 400
    elsif @user.update(user_params)
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 8], ["LIMIT", 1]]
UPDATE "users" SET "first_name" = $1, "last_name" = $2, "password_digest" = $3, "updated_at" = $4 WHERE "users"."id" = $5  [["first_name", "cloud "], ["last_name", "strife"], ["password_digest", "$2a$12$OfhoOEQDUQcCTAzSsshkfOUxCDbJNiSslOQAgtvapFjdO7KSpqeWq"], ["updated_at", "2022-02-05 02:05:07.910302"], ["id", 10]]

  def destroy
    @user = User.find_by(id: params[:id])
    if @user
      @user.destroy
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 8], ["LIMIT", 1]]
DELETE FROM "users" WHERE "users"."id" = $1  [["id", 8]]